__Only code__

In [1]:
import pandas as pd
import numpy as np

date =  pd.read_csv(r'C:\Users\Lenovo\Krishnaraj singh\Code\newml\Documents!.0\orders.csv')
time = pd.read_csv(r'C:\Users\Lenovo\Krishnaraj singh\Code\newml\Documents!.0\message.csv')

In [2]:
date.head(10)

       id  order_date ship_mode customer_id    sales
0  100006  2014-09-07  Standard    DK-13375  377.970
1  100090  2014-07-08  Standard    EB-13705  699.192
2  100293  2014-03-14  Standard    NF-18475   91.056
3  100328  2014-01-28  Standard    JC-15340    3.928
4  100363  2014-04-08  Standard    JM-15655   21.376
5  100391  2014-05-25  Standard    BW-11065   14.620
6  100678  2014-04-18  Standard    KM-16720  697.074
7  100706  2014-12-16    Second    LE-16810  129.440
8  100762  2014-11-24  Standard    NG-18355  508.620
9  100860  2014-03-26    Second    CS-12505   18.750

In [4]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5009 entries, 0 to 5008
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5009 non-null   int64
 1   order_date   5009 non-null   object
 2   ship_mode    5009 non-null   object
 3   customer_id  5009 non-null   object
 4   sales        5009 non-null   float64
dtypes: float64(1), int64(1), object(3)
memory usage: 195.8+ KB

In [6]:
# convert date (object ) to date 

date['order_date'] = pd.to_datetime(date['order_date'])

In [7]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5009 entries, 0 to 5008
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5009 non-null   int64
 1   order_date   5009 non-null   datetime64[ns]
 2   ship_mode    5009 non-null   object
 3   customer_id  5009 non-null   object
 4   sales        5009 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 195.8+ KB

- __Extract year__

In [8]:
date['Date_year'] = date['order_date'].dt.year

In [9]:
date['Date_year']

0       2014
1       2014
2       2014
3       2014
4       2014
        ...
5004    2017
5005    2017
5006    2017
5007    2017
5008    2017
Name: Date_year, Length: 5009, dtype: int32

- __Extract Month__

In [11]:
date['Date_month'] = date['order_date'].dt.month
date['Date_month']

0        9
1        7
2        3
3        1
4        4
        ..
5004    11
5005     7
5006     9
5007     8
5008     7
Name: Date_month, Length: 5009, dtype: int32

In [13]:
# For month name

date['Date_month'] = date['order_date'].dt.month_name()
date['Date_month']

0       September
1            July
2           March
3         January
4           April
          ...
5004     November
5005         July
5006    September
5007       August
5008         July
Name: Date_month, Length: 5009, dtype: object

In [15]:
date

          id order_date ship_mode customer_id     sales  Date_year Date_month
0     100006 2014-09-07  Standard    DK-13375   377.970       2014  September
1     100090 2014-07-08  Standard    EB-13705   699.192       2014       July
2     100293 2014-03-14  Standard    NF-18475    91.056       2014      March
3     100328 2014-01-28  Standard    JC-15340     3.928       2014    January
4     100363 2014-04-08  Standard    JM-15655    21.376       2014      April
...      ...        ...       ...         ...       ...        ...        ...
5004  168802 2017-11-03  Standard    JO-15145    18.368       2017   November
5005  169320 2017-07-23    Second    LH-16900   171.430       2017       July
5006  169488 2017-09-07     First    AA-10375    56.860       2017  September
5007  169502 2017-08-28  Standard    MG-17650   113.410       2017     August
5008  169551 2017-07-07     First    RL-19615  1344.838       2017       July

[5009 rows x 7 columns]

In [16]:
date['Date_day'] = date['order_date'].dt.day
date['Date_day']

0        7
1        8
2       14
3       28
4        8
        ..
5004     3
5005    23
5006     7
5007    28
5008     7
Name: Date_day, Length: 5009, dtype: int32

- __Find the week__

In [17]:
date['week'] = date['order_date'].dt.dayofweek
date['week']

0       6
1       1
2       4
3       1
4       1
       ..
5004    4
5005    6
5006    3
5007    0
5008    4
Name: week, Length: 5009, dtype: int32

In [18]:
date

,id,order_date,ship_mode,customer_id,sales,Date_year,Date_month,Date_day,week
0,100006,2014-09-07,Standard,DK-13375,377.970,2014,September,7,6
1,100090,2014-07-08,Standard,EB-13705,699.192,2014,July,8,1
2,100293,2014-03-14,Standard,NF-18475,91.056,2014,March,14,4
3,100328,2014-01-28,Standard,JC-15340,3.928,2014,January,28,1
4,100363,2014-04-08,Standard,JM-15655,21.376,2014,April,8,1
...,...,...,...,...,...,...,...,...,...
5004,168802,2017-11-03,Standard,JO-15145,18.368,2017,November,3,4
5005,169320,2017-07-23,Second,LH-16900,171.430,2017,July,23,6
5006,169488,2017-09-07,First,AA-10375,56.860,2017,September,7,3
5007,169502,2017-08-28,Standard,MG-17650,113.410,2017,August,28,0
5008,169551,2017-07-07,First,RL-19615,1344.838,2017,July,7,4

In [21]:

date['day'] = date['order_date'].dt.day_name()
date['day']

0         Sunday
1        Tuesday
2         Friday
3        Tuesday
4        Tuesday
          ...
5004      Friday
5005      Sunday
5006    Thursday
5007      Monday
5008      Friday
Name: day, Length: 5009, dtype: object

In [22]:
date

,id,order_date,ship_mode,customer_id,sales,Date_year,Date_month,Date_day,week,day
0,100006,2014-09-07,Standard,DK-13375,377.970,2014,September,7,Sunday,Sunday
1,100090,2014-07-08,Standard,EB-13705,699.192,2014,July,8,Tuesday,Tuesday
2,100293,2014-03-14,Standard,NF-18475,91.056,2014,March,14,Friday,Friday
3,100328,2014-01-28,Standard,JC-15340,3.928,2014,January,28,Tuesday,Tuesday
4,100363,2014-04-08,Standard,JM-15655,21.376,2014,April,8,Tuesday,Tuesday
...,...,...,...,...,...,...,...,...,...,...
5004,168802,2017-11-03,Standard,JO-15145,18.368,2017,November,3,Friday,Friday
5005,169320,2017-07-23,Second,LH-16900,171.430,2017,July,23,Sunday,Sunday
5006,169488,2017-09-07,First,AA-10375,56.860,2017,September,7,Thursday,Thursday
5007,169502,2017-08-28,Standard,MG-17650,113.410,2017,August,28,Monday,Monday
5008,169551,2017-07-07,First,RL-19615,1344.838,2017,July,7,Friday,Friday

In [28]:
date['week_no'] = date['order_date'].dt.isocalendar().week

In [29]:
date['week_no']

0       36
1       28
2       11
3        5
4       15
        ..
5004    44
5005    29
5006    36
5007    35
5008    27
Name: week_no, Length: 5009, dtype: UInt32

In [30]:
import datetime

today = datetime.datetime.today()

today - date['order_date']

0      4122 days 21:31:32.993094
1      4183 days 21:31:32.993094
2      4299 days 21:31:32.993094
3      4344 days 21:31:32.993094
4      4274 days 21:31:32.993094
                  ...
5004   2969 days 21:31:32.993094
5005   3072 days 21:31:32.993094
5006   3026 days 21:31:32.993094
5007   3036 days 21:31:32.993094
5008   3088 days 21:31:32.993094
Name: order_date, Length: 5009, dtype: timedelta64[ns]

In [31]:
(today - date['order_date']).dt.days

0       4122
1       4183
2       4299
3       4344
4       4274
        ...
5004    2969
5005    3072
5006    3026
5007    3036
5008    3088
Name: order_date, Length: 5009, dtype: int64